src/Documents/СХК_СписаниеЯчейки/СХК_СписаниеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СХК_СписаниеЯчейки</name>
  <registerRecords>AccumulationRegister.СХК_ТоварыНаСкладе</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснования</name>
    <type>
      <types>DocumentRef.РасходныйОрдерНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>Собран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыПоРаспоряжениям</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НЯчейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоКоличество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Собран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СобранныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиТовара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/СХК_СписаниеЯчейки/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Для Каждого стр Из ТоварыПоРаспоряжениям Цикл
		Если стр.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара Тогда
			стр.Собран = Истина;
		Иначе
			НСтр = ПолучитьНомерСтрокиДокумента(стр.Номенклатура, стр.Серия, стр.Упаковка);
			Если ТИПЗНЧ(НСтр) = ТИП("Число") Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Номенклатура", стр.Номенклатура);
				Отбор.Вставить("Серия", стр.Серия);
		    	//Отбор.Вставить("Упаковка",стр.Упаковка);
				Отбор.Вставить("НомерСтрокиТовара", НСтр);
				Строки = СобранныеТовары.НайтиСтроки(Отбор);
				итКол = 0;
				Если Строки.Количество() >= 1 Тогда

					Для сч = 0 По Строки.Количество() - 1 Цикл
						итКол = итКол + Строки[сч].Количество;
					КонецЦикла;

					Если итКол = стр.Количество Тогда
						стр.Собран = Истина;
					ИначеЕсли итКол > стр.Количество Тогда
						//ОшибкаСборки = Истина;
						Прервать;
					Иначе
						//стр.Собран = Ложь;
					КонецЕсли;

				КонецЕсли;
			Иначе
				ТоварыПоРаспоряжениям.Удалить(стр);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	Отбор = Новый Структура;
	Отбор.Вставить("Собран",Ложь);
	
	ПСтроки = ТоварыПоРаспоряжениям.НайтиСтроки(Отбор);
	
	Если ПСтроки.Количество() = 0 Тогда 
		Собран = Истина;
	КонецЕсли;
	
	
КонецПроцедуры


Функция ПолучитьНомерСтрокиДокумента(Ном,Сер,Уп)
	
	ош = "";
	
	Таб = ДокОснования.Ссылка.ОтгружаемыеТовары.Выгрузить(); 
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура",Ном);
	Отбор.Вставить("Серия",Сер);
	Отбор.Вставить("Упаковка",Уп);
	
	Строки = Таб.НайтиСтроки(Отбор);
	Если Строки.Количество() = 1 Тогда
		Если Строки[0].Действие <> Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать Тогда
			Возврат Число(Строки[0].НомерСтроки);
		Иначе
			ош = "Эту позицию НЕ ОТГРУЖАТЬ";
		КонецЕсли;
	Иначе
		ош = "Ошибка в документе";
	КонецЕсли;
	
	Возврат ош;
	
КонецФункции


Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.СХК_ТоварыНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаТЧТовары Из СобранныеТовары Цикл
		Движение = Движения.СХК_ТоварыНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТЧТовары.Номенклатура;
		Движение.Серия = Строка(ТекСтрокаТЧТовары.Серия);
		Движение.Ячейка = ТекСтрокаТЧТовары.Ячейка;
		Движение.ВНаличии = ТекСтрокаТЧТовары.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Собран = Ложь;  
	СобранныеТовары.Очистить(); 
	ТТ = ТоварыПоРаспоряжениям.Выгрузить();
	ТТ.ЗаполнитьЗначения(Ложь, "Собран"); 
	ТоварыПоРаспоряжениям.Загрузить(ТТ);
КонецПроцедуры
